Revit 2027 API
UIThemeManager Class
 Manager object for the UITheme class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIThemeManager
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class UIThemeManager
Public NotInheritable Class UIThemeManager
public ref class UIThemeManager abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UIThemeManager = class end
The UIThemeManager type exposes the following members.
Properties
Name | Description
CurrentCanvasTheme |  current canvas theme.
CurrentTheme |  The current overall theme which impacts the Revit frame and canvas.
FollowSystemColorTheme |  Indicate if the overall theme follows operating system color theme.
Top
Methods
Name | Description
GetThemeName |  Gets the theme name for the given theme type.
Top
See Also
Reference
Autodesk.Revit.UI Namespace